Repository: RomanVPX/resolution-suggester
Catalog: src/resolution_suggester/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: original
ru: Оригинал

source: excellent
ru: Практически идентичные изображения

source: very_good
ru: Очень хорошее качество

source: good
ru: Приемлемое качество

source: noticeable_loss
ru: Заметные потери

source: Peak Signal-to-Noise Ratio
ru: Пиковое отношение сигнала к шуму

source: Structural Similarity Index
ru: Индекс структурного сходства

source: Multi-Scale Structural Similarity Index
ru: Многоуровневый индекс структурного сходства

source: Texture Detail Preservation Ratio
ru: Коэффициент сохранения текстурных деталей

source: Bilinear interpolation
ru: Билинейная интерполяция

source: Bicubic interpolation
ru: Бикубическая интерполяция

source: Mitchell-Netravali filter
ru: Фильтр Митчелла-Нетравали

source: File
ru: Файл

source: Resolution
ru: Разрешение

source: ML model not found, the actual metrics will be calculated.
ru: ML-модель не найдена, будем вычислять реальные метрики.

source: Graph saved
ru: График сохранён

source: Quality
ru: Качество

source: depending on the resolution
ru: в зависимости от разрешения

source: Error when generating chart
ru: Ошибка при создании графика

source: Error when processing file
ru: Ошибка при обработке файла

source: File not found
ru: Файл не найден

source: MS-SSIM: unsupported images dimensions
ru: Неподдерживаемая размерность изображения для MS-SSIM

source: SSIM: unsupported images dimensions
ru: Неподдерживаемая размерность изображения для SSIM

source: calculate_metrics: The shapes of the images must match!
ru: calculate_metrics: Размеры изображений должны совпадать!

source: calculate_metrics: The dimensions of the images must match!
ru: calculate_metrics: Размерности изображений должны совпадать!

source: Unsupported quality metric
ru: Метрика не поддерживается

source: Unexpected error
ru: Непредвиденная ошибка

source: Error parsing arguments
ru: Ошибка разбора аргументов

source: Dataset generated
ru: Датасет сгенерирован

source: Model trained!
ru: Модель обучена!

source: Chart generation enabled
ru: Включена генерация графиков

source: Failed to import matplotlib.
ru: Не удалось импортировать matplotlib. Установите его командой: pip install matplotlib

source: Metrics(CSV) saved to
ru: Метрики (CSV) сохранены в

source: Metrics(JSON) saved to
ru: Метрики (JSON) сохранены в

source: CSV output enabled, file
ru: Вывод в CSV включён, файл

source: JSON output enabled, file
ru: Вывод в JSON включён, файл

source: Error when closing reporter
ru: Ошибка при закрытии репортера

source: Skipping
ru: Пропуск

source: because failed to load
ru: т.к. не удалось загрузить

source: Error when selecting interpolation function for
ru: Ошибка при выборе функции интерполяции для

source: Creating dataset
ru: Создание датасета

source: No data to save in
ru: Нет данных для сохранения в

source: Preprocessor is not loaded
ru: Препроцессор не загружен

source: Channel model is not loaded
ru: Поканальная модель не загружена

source: Combined model is not loaded
ru: Совмещённая модель не загружена

source: Texture quality analysis tool
ru: Инструмент анализа качества текстур

source: Show this help message and exit
ru: Показать эту справку и выйти

source: Interface language (default: auto)
ru: Язык интерфейса (по умолчанию: автоопределение)

source: Paths to files/directories for analysis
ru: Пути к файлам/директориям для анализа

source: Analysis by color channels
ru: Анализ по цветовым каналам

source: Export results to CSV
ru: Экспорт результатов в CSV

source: Export results to JSON
ru: Экспорт результатов в JSON

source: Generate quality vs. resolution charts
ru: Генерация графиков качества в зависимости от разрешения

source: Charts theme (default: dark)
ru: Выбор темы для графиков (по умолчанию: темная)

source: Minimum size (width and height) for analysis (default and minimum:
ru: Минимальный размер (по ширине и высоте) для анализа (по умолчанию и минимально:

source: Save downscale results produced during analysis
ru: Сохранять результаты даунскейла, производимого во время анализа

source: (does not work with --ml, --train-ml and --generate-dataset)
ru: (не работает с --ml, --train-ml и --generate-dataset)

source: Save upscale results produced after downscale
ru: Сохранять результаты апскейла, произведённого после даунскейла

source: Save all image scaling results (downscale and upscale)
ru: Сохранять результаты все результаты масштабирования изображений (даунскейл и апскейл)

source: Disable parallel processing and use single-threaded scheme
ru: Отключить параллельную обработку и использовать однопоточную схему

source: Do not use GPU for metrics calculation (in case of problems with CUDA, MPS, etc. in PyTorch)
ru: Не использовать GPU для расчёта метрик (на случай проблем с CUDA, MPS и т.д. в PyTorch)

source: Generate dataset (features/targets) for model training
ru: Сгенерировать датасет (features/targets) для обучения модели

source: Train ML model after dataset generation
ru: После генерации датасета обучить модель ML

source: Use ML model to predict metrics instead of real calculation (fast)
ru: Использовать ML-модель для предсказания метрик вместо реального вычисления (быстро)

source: Number of parallel processes for file processing. Ignored with --no-parallel,
ru: Число параллельных процессов для обработки файлов. Игнорируется при --no-parallel,

source: default is
ru: по умолчанию равно

source: logical processor cores detected:
ru: логических ядер процессора обнаружено

source: default
ru: по умолчанию

source: Available quality metrics
ru: Доступные метрики качества

source: Available interpolation methods
ru: Доступные методы интерполяции

source: Analysis
ru: Анализ

source: Quality Bar
ru: Индикатор

source: Quality vs Resolution Relationship
ru: Зависимость качества от разрешения

source: Quality Levels
ru: Качество

source: Total Pixels (log scale)
ru: Общее число пикселей (логарифмическая шкала)
